{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/root/.cache/modelscope/hub/models/qwen/Qwen3-VL-2B-Instruct",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "visual.blocks.*.attn.proj",
    "up_proj",
    "v_proj",
    "gate_proj",
    "k_proj",
    "q_proj",
    "visual.blocks.*.mlp.linear_fc2",
    "visual.blocks.*.mlp.linear_fc1",
    "visual.patch_embed.proj",
    "visual.pos_embed",
    "visual.deepstack_merger_list.*",
    "visual.blocks.*.attn.qkv",
    "o_proj",
    "down_proj",
    "visual.merger.*"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}